# 1.Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.

# Пример:

# - 6782 -> 23
# - 0,56 -> 11

n = input('Введите число ')
sum_of_digits = 0
for i in n:
    if i != '.':
     sum_of_digits += int(i)
print('Sum', sum_of_digits )






